app/controllers/other/categories_controller.rb

  def index

    texto = "%#{params[:txtbus]}%"

    puts "------->"+texto


    if texto.nil?
      @categories = Category.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "categories".* FROM "categories" WHERE (description LIKE '%%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "categories" WHERE (description LIKE '%%')