app/controllers/categories_controller.rb

  def index

    texto = "%#{params[:txtbus]}%"

    puts "------->"+texto


    if texto.nil?
      @categories = Category.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "categories".* FROM "categories" WHERE (description LIKE '%smartphone%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "categories" WHERE (description LIKE '%%')

  def create
    @category = Category.new(category_params)




    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hardware"], ["description", "para agrupar todos los productros hardwaRWE"], ["created_at", "2017-11-11 15:06:04.892674"], ["updated_at", "2017-11-11 15:06:04.892674"]]